// Реализовать иерархию классов "Транспортное средство". В абстрактном базовом классе реализовать набор чисто виртуальных методов
//(ввод - вывод, расход топлива, получение стоимости, установка стоимости, грузоподъёмность, количество мест для пассажиров).
//Потомки переопределяют чисто виртуальные методы.Создать массив указателей базового класса.Каждый элемент указывает на объект потомка.
//Поочерёдно вызывая методы в переборном цикле, освобождаем память.

#pragma once
#include "Transport.h"
class motorbike :
    public Transport
{
public:
	motorbike();
	void Fuel();
	void Output();
	void Consumption();
	void Price();
	void Carrying();
	void Passengers();
};

